In [1]:
#import library
import pandas as pd

In [2]:
books = pd.read_csv('books.csv')

In [3]:
books.columns

Index(['id', 'book_id', 'best_book_id', 'work_id', 'books_count', 'isbn',
       'isbn13', 'authors', 'original_publication_year', 'original_title',
       'title', 'language_code', 'average_rating', 'ratings_count',
       'work_ratings_count', 'work_text_reviews_count', 'ratings_1',
       'ratings_2', 'ratings_3', 'ratings_4', 'ratings_5', 'image_url',
       'small_image_url'],
      dtype='object')

In [4]:
books = books[['id','isbn' ,'best_book_id', 'original_title', 'books_count', 'average_rating']]

In [5]:
books.head()

,id,isbn,best_book_id,original_title,books_count,average_rating
0,1,439023483,2767052,The Hunger Games,272,4.34
1,2,439554934,3,Harry Potter and the Philosopher's Stone,491,4.44
2,3,316015849,41865,Twilight,226,3.57
3,4,61120081,2657,To Kill a Mockingbird,487,4.25
4,5,743273567,4671,The Great Gatsby,1356,3.89

In [6]:
books.shape

(10000, 6)

In [7]:
book_tags = pd.read_csv('book_tags.csv')
book_tags = book_tags[['goodreads_book_id', 'tag_id']]

In [8]:
l = {}
for i , id in enumerate(book_tags.goodreads_book_id):
    if not id in l.keys():
        l[id] = []
    
    l[id].append(book_tags.iloc[i].tag_id)

In [9]:
df = pd.DataFrame(list(l.items()), columns = ['ids', 'tags'])

In [10]:
df.head()

   ids                                               tags
0    1  [30574, 11305, 11557, 8717, 33114, 11743, 1401...
1    2  [30574, 8717, 11305, 11557, 6857, 6888, 2104, ...
2    3  [30574, 11557, 11305, 8717, 33114, 11743, 1401...
3    5  [11557, 11305, 8717, 33114, 30574, 11743, 1401...
4    6  [11305, 33114, 11743, 14017, 22743, 32989, 271...

In [11]:
df.shape

(10000, 2)

In [12]:
#Merge 2 datasets in deffrent excel sheet
books = books.merge(df, left_on="best_book_id", right_on="ids")
books.drop(['ids', 'id'], axis = 1, inplace=True)

In [13]:
books.head()

,isbn,best_book_id,original_title,books_count,average_rating,tags
0,439023483,2767052,The Hunger Games,272,4.34,"[11557, 8717, 33114, 11743, 10064, 30574, 1005..."
1,439554934,3,Harry Potter and the Philosopher's Stone,491,4.44,"[30574, 11557, 11305, 8717, 33114, 11743, 1401..."
2,316015849,41865,Twilight,226,3.57,"[33114, 11305, 11557, 31745, 32989, 11743, 305..."
3,61120081,2657,To Kill a Mockingbird,487,4.25,"[7457, 11557, 30574, 7404, 14487, 22743, 26735..."
4,743273567,4671,The Great Gatsby,1356,3.89,"[7457, 11557, 11743, 7404, 5207, 22743, 18367,..."

In [14]:
books.isna().sum()

isbn              617
best_book_id        0
original_title    562
books_count         0
average_rating      0
tags                0
dtype: int64

In [15]:
books = books.dropna(axis=0)

In [16]:
books.shape

(8705, 6)

In [17]:
books.to_csv('final_data.csv', index=False)